In [2]:
data = [
    {"email":"dss@gmail.com","name":"dss","id":1},
    {"email":"fcamp@daum.net","name":"fcamp","id":2},
    {"email":"andy@naver.com","name":"andy","id":3},
]

In [4]:
df = pd.DataFrame(data)
df

            email   name  id
0   dss@gmail.com    dss   1
1  fcamp@daum.net  fcamp   2
2  andy@naver.com   andy   3

### apply() 함수 사용법
- map 함수와 비슷

In [9]:
# email 컬럼에서 메일의 도메인만 가져와서 새로운 도메인 컬럼을 생성하고 싶을 때

In [10]:
def domain(email):
    return email.split("@")[1].split(".")[0]

In [12]:
# df['email'] 은 Series 데이터 이다.
df['domain'] = df['email'].apply(domain)
df

            email   name  id domain
0   dss@gmail.com    dss   1  gmail
1  fcamp@daum.net  fcamp   2   daum
2  andy@naver.com   andy   3  naver

In [14]:
df['domain2'] = df['email'].apply(lambda x : x.split("@")[1].split(".")[0])
df

            email   name  id domain domain2
0   dss@gmail.com    dss   1  gmail   gmail
1  fcamp@daum.net  fcamp   2   daum    daum
2  andy@naver.com   andy   3  naver   naver

In [15]:
# makedata.py Import
from makedata import get_age, get_name, make_data

In [17]:
get_age(), get_name(), make_data()

(28,
 'Anchal',
 [{'Age': 38, 'Name': 'Arnold'},
  {'Age': 21, 'Name': 'Alvin'},
  {'Age': 21, 'Name': 'Billy'},
  {'Age': 37, 'Name': 'Alan'},
  {'Age': 30, 'Name': 'Arnold'},
  {'Age': 20, 'Name': 'Alvin'},
  {'Age': 24, 'Name': 'Arnold'},
  {'Age': 29, 'Name': 'Arnold'},
  {'Age': 35, 'Name': 'Anthony'},
  {'Age': 37, 'Name': 'Anthony'}])

In [20]:
df1 = pd.DataFrame(make_data(5))
df2 = pd.DataFrame(make_data(5))
df2

   Age    Name
0   38    Alan
1   21    Adam
2   31  Anchal
3   29  Anchal
4   39    Adam

### append() 함수 사용법

In [29]:
# append 데이터 프레임 합치기
df3 = df1.append(df2, ignore_index=True)
df3

   Age    Name
0   27   Billy
1   22    Alex
2   40  Arnold
3   34  Andrew
4   35    Adam
5   38    Alan
6   21    Adam
7   31  Anchal
8   29  Anchal
9   39    Adam

In [30]:
# reset_index 함수로 인덱스 재정렬
# drop : reset_index하면서 생긴 index 컬럼 DROP 여부
# inplace : reset_index 후 DF에 데이터 값을 저장
df3.reset_index(drop=True, inplace=True)
df3.tail(3)

   Age    Name
7   31  Anchal
8   29  Anchal
9   39    Adam

In [ ]:
# Ccon